LZH12345lzh/RA6M5/src/hal_entry.c
#include "hal_data.h"
#include "bsp_led.h"
#include "bsp_key.h"
#include "bsp_uart4.h"
#include "i2c_ee.h"
#include "bsp_led.h"
#include "bsp_qspi_flash.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"
#include "Led_Task.h"
#include "Key_Task.h"
#include "Debug_Task.h"
#include "Fatfs_Task.h"
#include "Adc_Task.h"
#include "Pwm_Task.h"
#include "qe_touch_sample.h"
#include "Systick_Task.h"
#include "event_groups.h"
#include "Wdt_Task.h"
#include "bsp_qspi_flash.h"



FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER


#define Delay(a)    R_BSP_SoftwareDelay(a,BSP_DELAY_UNITS_MILLISECONDS)
#define  BufferSize (countof(Tx_Buffer)-1)


/* 发送缓冲区初始化 */
uint8_t Tx_Buffer[] = "外部Flash测试\r\n";
uint8_t Rx_Buffer[sizeof(Tx_Buffer)];

uint32_t FlashDeviceID = 0;
uint32_t FlashID = 0;

SemaphoreHandle_t xSemaphore;
TaskHandle_t xHandleTaskTouch = NULL;


/* 事件组句柄 */
EventGroupHandle_t xEventGroup;

#define  FLASH_WriteAddress     0x00000
#define  FLASH_ReadAddress      FLASH_WriteAddress
#define  FLASH_SectorToErase    FLASH_WriteAddress




/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */
		
		Debug_UART4_Init();
	#if 1
		
		I2C_EE_Init();
		QSPI_FLASH_Init();
		printf("这是一个I2C外设(AT24C02)读写测试例程 \r\n");
    R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_SECONDS);
		I2C_EE_Writedrase();
		if (I2C_Test() ==1) {
				LED3_ON;
		} else {
				LED1_ON;
		}
		Delay(10);
		 /* 获取 Flash Device ID */
    FlashDeviceID = QSPI_FLASH_ReadDeviceID();
    Delay(200);

    /* 获取 SPI Flash ID */
    FlashID = QSPI_FLASH_ReadID();
    printf("\r\nFlashID is 0x%X,Manufacturer Device ID is 0x%X\r\n", FlashID, FlashDeviceID);


    if ((FlashID == FLASH_ID_W25Q32JV)||(FlashID == FLASH_ID_AT25SF321B))
    {
        if(FlashID == FLASH_ID_W25Q32JV)
        {
            printf("检测到串行flash W25Q32 !\r\n");
        }else{
            printf("检测到串行flash AT25SF32 !\r\n");
        }

        /* 擦除将要写入的 SPI FLASH 扇区，FLASH写入前要先擦除 */
        // 这里擦除4K，即一个扇区，擦除的最小单位是扇区
        QSPI_FLASH_SectorErase(FLASH_SectorToErase);

        /* 将发送缓冲区的数据写到flash中 */
        // 这里写一页，一页的大小为256个字节
        QSPI_FLASH_BufferWrite(Tx_Buffer, FLASH_WriteAddress, sizeof(Tx_Buffer));
        printf("写入的数据为：%s \r\n", Tx_Buffer);

        /* 将刚刚写入的数据读出来放到接收缓冲区中 */
        QSPI_FLASH_BufferRead(Rx_Buffer, FLASH_ReadAddress, sizeof(Tx_Buffer));
        printf("读出的数据为：%s \r\n", Rx_Buffer);

        int a;
        a = Buffercmp(Tx_Buffer, Rx_Buffer, sizeof(Tx_Buffer));

        if (a == 0)
        {
            printf("\r\n32Mbit串行flash测试成功!\n\r");
            LED1_ON;
        }
        else
        {
            printf("\r\n32Mbit串行flash测试失败!\n\r");
            LED3_ON;
        }

    }
    else
    {
        LED1_ON;
        printf("获取不到ID!\n\r");
    }
		#endif
		// 创建二值信号量
		xSemaphore = xSemaphoreCreateBinary();
    // 初始化信号量为 "未给出" 状态
    xSemaphoreGive(xSemaphore);
		/* 创建递归锁 */
    xEventGroup = xEventGroupCreate( );
		if( xEventGroup != NULL )
		{
				//xTaskCreate(vLed_Task,"vLed_Task", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + configMAX_PRIORITIES-1 ,NULL);		
				xTaskCreate(vDebug_Task,		"vDebug_Task",	 2*configMINIMAL_STACK_SIZE, NULL, 1 ,NULL);	
				xTaskCreate(vKey_Task,			"vKey_Task", 		 1*configMINIMAL_STACK_SIZE, NULL, 1 ,NULL);
//				xTaskCreate(vFatfs_Task,		"vFatfs_Task", 	 2*configMINIMAL_STACK_SIZE, NULL, 2 ,NULL);
				xTaskCreate(vAdc_Task,			"vAdc_Task", 		 1*configMINIMAL_STACK_SIZE, NULL, 1 ,NULL);
				xTaskCreate(vPwm_Task,			"vPwm_Task",     1*configMINIMAL_STACK_SIZE, NULL, 1 ,NULL);
				xTaskCreate(qe_touch_main,	"qe_touch_main", 1*configMINIMAL_STACK_SIZE, NULL, 2 ,&xHandleTaskTouch);
				xTaskCreate(vWdt_Task,			"vWdt_Task", 		 1*configMINIMAL_STACK_SIZE, NULL, 3 ,NULL);
//				xTaskCreate(vSystick_Task,"vSystick_Task", configMINIMAL_STACK_SIZE, NULL, 1 ,&xHandleTaskTouch);
				vTaskStartScheduler();
		}
		else
		{
		}
		
			
		
#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart (bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open(&g_ioport_ctrl, g_ioport.p_cfg);
    }
}

#if BSP_TZ_SECURE_BUILD

BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
#endif
#if( configUSE_MALLOC_FAILED_HOOK == 1 )
void vApplicationMallocFailedHook(void){
        for(;;){
                //vTaskDelay(pdMS_TO_TICKS(1000));
					     size_t num = xPortGetFreeHeapSize();
								printf("vApplicationMallocFailedHook:%d\n",num);
        }
}
void vApplicationStackOverflowHook( TaskHandle_t xTask, char *pcTaskName ){
				FSP_PARAMETER_NOT_USED(xTask);
        for(;;){
                //vTaskDelay(pdMS_TO_TICKS(1000));
					printf("vApplicationStackOverflowHook--pcTaskName = %s\n",pcTaskName);
        }
}

#endif